#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//输出什么？

//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111
//
//	signed char b = -1;
//	//11111111
//	unsigned char c = -1;
//	//11111111
//
//	printf("a = %d\nb = %d\nc = %d\n", a, b, c);
//	//整型提升后的补码
//	//11111111111111111111111111111111 - a
//	//11111111111111111111111111111111 - b
//	//00000000000000000000000011111111 - c
//	//c为正数，原、反、补码相同
//	return 0;
//}

//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000
//	//10000000
//	printf("%u\n", a);
//	//整型提升
//	//高位补0还是1看的是自身类型而不是打印类型
//	//11111111111111111111111110000000 - 补码
//	//无符号数字原反补相同
//	//11111111111111111111111110000000 - 原码
//	return 0;
//}

//对比
//int main()
//{
//	unsigned int a = -128;
//	printf("%d\n", a);
//	return 0;
//}
//
//int main()
//{
//	unsigned int a = -128;
//	printf("%u\n", a);
//	return 0;
//}

//int main()
//{
//	char a = 128;
//	char c = 129;
//	char e = 256;
//	char g = 257;
//	char i = 384;
//	unsigned char b = 128;
//	unsigned char d = 129;
//	unsigned char f = 256;
//	unsigned char h = 257;
//	unsigned char j = 384;
//	//a and b
//	//00000000000000000000000010000000 
//	//10000000 
//	//c and d
//	//00000000000000000000000010000001
//	//10000001
//	printf("%u\n", a);
//	printf("%u\n", c);
//	printf("%u\n", e);
//	printf("%u\n", g);
//	printf("%u\n", i);
//	printf("%u\n", b);
//	printf("%u\n", d);
//	printf("%u\n", f);
//	printf("%u\n", h);
//	printf("%u\n", j);
//	//整型提升
//	//无符号数原反补相同
//	//11111111111111111111111110000000 - a
//	//00000000000000000000000010000000 - b
//	//11111111111111111111111110000001 - c
//	//00000000000000000000000010000001 - d
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100
//	unsigned int j = 10;
//	//00000000000000000000000000001010
//	printf("%d\n", i + j);
//	//11111111111111111111111111110110
//	//11111111111111111111111111110101
//	//10000000000000000000000000001010
//	return 0;
//}

//#include<windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}

//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}

//int main()
//{
//	double d = 1E10;
//	printf("%lf\n", d);
//	return 0;
//}


